import aes
import sys
import os
from config import get_config
from mongo import Mongo
from mysql import MySql

class Tumor(object):
	"""更新patient表tumor"""
	def __init__(self, config):
		self._config = get_config(config)
		self._mysql = MySql(self._config).connect('isee-mysql')

	def update_tumor(self):
		data = self._mysql.table('patient').get()
		dict_tumors = {
			'扁桃体癌':'耳鼻喉神经内分泌肿瘤',
			'鼻腔鼻窦神经内分泌瘤':'头颈部肿瘤',
			'扁桃体鳞癌':'头颈部鳞癌',
			'肠癌':'结直肠癌',
			'肺淋巴上皮瘤样':'肺淋巴上皮瘤样癌',
			'腹膜浆液性瘤':'腹膜浆液性、交界性瘤/不典型增生浆液性瘤',
			'肝胃间隙恶性肿瘤':'胃间叶性肿瘤',
			'睾丸胚胎性癌':'睾丸和睾丸旁组织肿瘤',
			'高级别浆溶性卵巢癌':'高级别浆液性卵巢癌',
			'髂骨原始神经外胚层肿瘤':'脑原始神经外胚层肿瘤',
			'颈癌':'头颈部肿瘤',
			'股骨近端骨肿瘤':'骨肿瘤',
			'骨癌':'骨肿瘤',
			'骨外原始神经外胚肿瘤':'骨肿瘤',
			'混合性生殖细胞癌':'卵巢混合性生殖细胞肿瘤',
			'基底细胞癌':'胸腺基底细胞癌',
			'间变型星形细胞瘤':'脑弥漫型星形细胞瘤和间变型星形细胞瘤',
			'间皮瘤':'腹膜间皮瘤',
			'间质瘤':'不明原发部位肿瘤',
			'胶质瘤':'脑胶质瘤',
			'浸润性黏癌':'肺浸润性粘液腺癌',
			'棱形细胞瘤':'未分化梭形细胞肉瘤',
			'淋巴瘤':'恶性淋巴瘤',
			'淋巴上皮样胆管细胞癌':'肝癌',
			'淋巴细胞癌':'恶性淋巴瘤',
			'卵管癌':'输卵管癌',
			'弥漫性B淋巴细胞瘤':'弥漫大B细胞淋巴瘤',
			'弥漫性B细胞淋巴瘤':'弥漫大B细胞淋巴瘤',
			'粘液表皮样癌':'胸腺粘液表皮样癌',
			'粘液脂肪肉瘤':'粘液样脂肪肉瘤',
			'皮肤鳞癌':'皮肤鳞状细胞癌',
			'平滑肌癌':'平滑肌肉瘤',
			'前纵隔低分化细胞癌':'前纵膈肿瘤',
			'前纵隔神经内分泌瘤':'前纵膈肿瘤',
			'前纵隔中分化鳞癌':'前纵膈肿瘤',
			'纤维性母细胞肿瘤':'低级别肌纤维母细胞肉瘤',
			'侵袭性纤维瘤病':'硬纤维/侵袭性纤维瘤病',
			'韧带样纤维病':'韧带样纤维瘤病',
			'肉瘤':'NOS肉瘤',
			'神经鞘膜瘤':'恶性外周神经鞘膜瘤',
			'肾孟尿路上皮癌':'肾盂尿路上皮癌',
			'肾盂癌':'肾盂肿瘤',
			'声门神经内分泌瘤':'声门癌',
			'生殖细胞源性肿瘤':'胸腺生殖细胞源性肿瘤',
			'输尿管恶性肿瘤':'输尿管癌',
			'髓母细胞瘤':'脑髓母细胞瘤',
			'梭型细胞肿瘤':'梭形细胞/硬化性横纹肌肉瘤',
			'梭形细胞瘤':'梭形细胞/硬化性横纹肌肉瘤',
			'梭形细胞软组织肿瘤':'未分化梭形细胞肉瘤',
			'头颈癌':'头颈部肿瘤',
			'头颈磷癌':'头颈部鳞癌',
			'头颈鳞癌':'头颈部鳞癌',
			'头皮肤鳞癌':'皮肤鳞状细胞癌',
			'外周神经鞘膜瘤':'恶性外周神经鞘膜瘤',
			'外周原神经外胚层瘤':'脑原始神经外胚层肿瘤',
			'胃肠间质瘤':'胃肠道间质瘤',
			'胃窦癌':'胃癌',
			'胃间质瘤':'胃肠道间质瘤',
			'胃角质瘤':'胃癌',
			'胃恶性肿瘤':'胃癌',
			'胃小细胞癌':'胃癌',
			'胃印戎细胞癌':'胃印戒细胞癌',
			'峡癌':'咽部癌',
			'下颌骨鳞状细胞癌':'头颈部鳞癌',
			'下咽部鳞癌':'下咽鳞癌',
			'消化道肿瘤':'食管癌',
			'小细胞肺瘤':'小细胞肺癌',
			'小细胞神经内分泌瘤':'小细胞神经内分泌肿瘤',
			'小细胞恶性肿瘤':'小细胞神经内分泌肿瘤',
			'小细胞型神经内分泌瘤':'小细胞神经内分泌肿瘤',
			'小圆细胞癌':'增生性小圆细胞肿瘤',
			'小圆形细胞肿瘤':'增生性小圆细胞肿瘤',
			'星形细胞瘤':'脑其他星形细胞瘤',
			'胸部鳞状细胞癌':'胸腺鳞状细胞癌',
			'胸膜癌':'胸膜肿瘤',
			'胸膜间质瘤':'胸膜间皮瘤',
			'胸腺内胚层窦瘤':'胸腺内胚层窦瘤-卵黄囊瘤',
			'牙龈癌':'口腔癌',
			'牙龈鳞癌':'口腔鳞癌',
			'咽癌':'咽部癌',
			'腋窝恶性肿瘤':'恶性淋巴瘤',
			'阴囊皮肤肿瘤':'皮肤癌',
			'周围神经鞘膜瘤':'子宫颈恶性外周神经鞘肿瘤',
			'子宫癌':'子宫体癌',
			'子宫内膜样癌':'子宫内膜癌',
			'子宫原始神经外胚叶肿瘤':'子宫颈恶性外周神经鞘肿瘤',
			'纵隔鳞癌':'纵膈肿瘤',
			'纵隔肿瘤':'纵膈肿瘤'
		}
		dict = {}
		for record in data:
			id = record.get("id")
			tumor_type = record.get("tumor_type")
			for tumor in dict_tumors.keys():					
				if tumor_type == tumor:
					dict['tumor_type'] = dict_tumors[tumor]
					self._mysql.table('patient').where('id',id).update(dict)

					


if __name__ == '__main__':
	o = Tumor(sys.argv[1])
	o.update_tumor()

"""
. 匹配除换行符以外的任意字符

\w 匹配字母或数字或下划线或汉字 等价于 '[^A-Za-z0-9_]'。

\s 匹配任意的空白符

\d 匹配数字

\b 匹配单词的开始或结束

^ 匹配字符串的开始

$ 匹配字符串的结束

\w能不能匹配汉字要视你的操作系统和你的应用环境而定
"""